## Plan Result (1022: nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 15 to change, 15 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.ag
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-confluence-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-confluence-04&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-crowd-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-gluster-03&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-01&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-02&#34;]
  * azurerm_backup_protected_vm.vm-backup[&#34;atlassian-nonprod-jira-03&#34;]
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_postgresql_flexible_server.atlassian-flex-server-v15[0]
  * azurerm_postgresql_server.atlassian-server[0]
  * sendgrid_api_key.sendgrid-jira-api-key
* Delete
  * azurerm_key_vault_secret.temp-backup-vm-password-secret[0]
  * azurerm_linux_virtual_machine.temp-backup-vm[0]
  * azurerm_network_interface.temp-backup-vm-nic[0]
  * random_password.temp-backup-vm-password[0]
  * terraform_data.temp-backup-vm[0]
  * module.temp-vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
* Replace
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-04&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-crowd-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-03&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-03&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-confluence-02"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-confluence-02/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-confluence-02"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-confluence-04"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-confluence-04/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-confluence-04"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-crowd-01"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-crowd-01/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-crowd-01"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-01"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-01/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-01"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-02"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-02/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-02"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-gluster-03"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-03/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-gluster-03"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-01"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-01/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-01"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-02"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-02/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-02"
        # (4 unchanged attributes hidden)
    }

  # azurerm_backup_protected_vm.vm-backup["atlassian-nonprod-jira-03"] will be updated in-place
  ~ resource "azurerm_backup_protected_vm" "vm-backup" {
      + backup_policy_id    = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupPolicies/atlassian-nonprod-vm-backup-policy"
        id                  = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.RecoveryServices/vaults/atlassian-nonprod-rsv/backupFabrics/Azure/protectionContainers/IaasVMContainer;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-03/protectedItems/VM;iaasvmcontainerv2;atlassian-nonprod-rg;atlassian-nonprod-jira-03"
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.temp-backup-vm-password-secret[0] will be destroyed
  # (because azurerm_key_vault_secret.temp-backup-vm-password-secret is not in configuration)
  - resource "azurerm_key_vault_secret" "temp-backup-vm-password-secret" {
      - id                      = "https://atlasssian-nonprod-kv.vault.azure.net/secrets/temp-backup-vm-password/6b8126f5639247dab1c75ab21e380a18" -> null
      - key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv" -> null
      - name                    = "temp-backup-vm-password" -> null
      - resource_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv/secrets/temp-backup-vm-password/versions/6b8126f5639247dab1c75ab21e380a18" -> null
      - resource_versionless_id = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv/secrets/temp-backup-vm-password" -> null
      - tags                    = {
          - "application"  = "atlassian"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "staging"
          - "expiresAfter" = "2025-05-15"
          - "startupMode"  = "always"
        } -> null
      - value                   = (sensitive value) -> null
      - value_wo                = (write-only attribute) -> null
      - value_wo_version        = 0 -> null
      - version                 = "6b8126f5639247dab1c75ab21e380a18" -> null
      - versionless_id          = "https://atlasssian-nonprod-kv.vault.azure.net/secrets/temp-backup-vm-password" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_linux_virtual_machine.temp-backup-vm[0] will be destroyed
  # (because azurerm_linux_virtual_machine.temp-backup-vm is not in configuration)
  - resource "azurerm_linux_virtual_machine" "temp-backup-vm" {
      - admin_password                                         = (sensitive value) -> null
      - admin_username                                         = "backupadmin" -> null
      - allow_extension_operations                             = true -> null
      - bypass_platform_safety_checks_on_user_schedule_enabled = false -> null
      - computer_name                                          = "temp-backup-vm" -> null
      - disable_password_authentication                        = false -> null
      - encryption_at_host_enabled                             = false -> null
      - extensions_time_budget                                 = "PT1H30M" -> null
      - id                                                     = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/temp-backup-vm" -> null
      - location                                               = "uksouth" -> null
      - max_bid_price                                          = -1 -> null
      - name                                                   = "temp-backup-vm" -> null
      - network_interface_ids                                  = [
          - "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkInterfaces/temp-backup-vm-nic",
        ] -> null
      - patch_assessment_mode                                  = "AutomaticByPlatform" -> null
      - patch_mode                                             = "ImageDefault" -> null
      - platform_fault_domain                                  = -1 -> null
      - priority                                               = "Regular" -> null
      - private_ip_address                                     = "10.0.4.210" -> null
      - private_ip_addresses                                   = [
          - "10.0.4.210",
        ] -> null
      - provision_vm_agent                                     = true -> null
      - public_ip_addresses                                    = [] -> null
      - resource_group_name                                    = "atlassian-nonprod-rg" -> null
      - secure_boot_enabled                                    = false -> null
      - size                                                   = "Standard_D2s_v3" -> null
      - tags                                                   = {
          - "application"  = "atlassian"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "staging"
          - "expiresAfter" = "2025-05-15"
          - "startupMode"  = "always"
        } -> null
      - virtual_machine_id                                     = "4f02c7b2-68c6-4698-9a62-3fe6a505cd39" -> null
      - vm_agent_platform_updates_enabled                      = false -> null
      - vtpm_enabled                                           = false -> null
        # (15 unchanged attributes hidden)

      - os_disk {
          - caching                          = "ReadWrite" -> null
          - disk_size_gb                     = 64 -> null
          - id                               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/temp-backup-vm_OsDisk_1_04cb0dfa4a274856a2345caf0db5f424" -> null
          - name                             = "temp-backup-vm_OsDisk_1_04cb0dfa4a274856a2345caf0db5f424" -> null
          - storage_account_type             = "Standard_LRS" -> null
          - write_accelerator_enabled        = false -> null
            # (3 unchanged attributes hidden)
        }

      - source_image_reference {
          - offer     = "0001-com-ubuntu-server-jammy" -> null
          - publisher = "Canonical" -> null
          - sku       = "22_04-lts" -> null
          - version   = "latest" -> null
        }
    }

  # azurerm_network_interface.temp-backup-vm-nic[0] will be destroyed
  # (because azurerm_network_interface.temp-backup-vm-nic is not in configuration)
  - resource "azurerm_network_interface" "temp-backup-vm-nic" {
      - accelerated_networking_enabled = false -> null
      - applied_dns_servers            = [] -> null
      - dns_servers                    = [] -> null
      - id                             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/networkInterfaces/temp-backup-vm-nic" -> null
      - internal_domain_name_suffix    = "ygysg2ix1xfehcfemfnemkbkwe.zx.internal.cloudapp.net" -> null
      - ip_forwarding_enabled          = false -> null
      - location                       = "uksouth" -> null
      - mac_address                    = "60-45-BD-10-02-80" -> null
      - name                           = "temp-backup-vm-nic" -> null
      - private_ip_address             = "10.0.4.210" -> null
      - private_ip_addresses           = [
          - "10.0.4.210",
        ] -> null
      - resource_group_name            = "atlassian-nonprod-rg" -> null
      - tags                           = {
          - "application"  = "atlassian"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "staging"
          - "expiresAfter" = "2025-05-15"
          - "startupMode"  = "always"
        } -> null
      - virtual_machine_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/temp-backup-vm" -> null
        # (4 unchanged attributes hidden)

      - ip_configuration {
          - name                                               = "temp-backup-vm-nic" -> null
          - primary                                            = true -> null
          - private_ip_address                                 = "10.0.4.210" -> null
          - private_ip_address_allocation                      = "Static" -> null
          - private_ip_address_version                         = "IPv4" -> null
          - subnet_id                                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-int-nonprod-vnet/subnets/atlassian-int-subnet-app" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server"
        name                              = "atlassian-nonprod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server-v15[0] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server-v15" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server-v15"
        name                              = "atlassian-nonprod-flex-server-v15"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_server.atlassian-server[0] will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password            = (sensitive value)
        id                                      = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                                    = "atlassian-nonprod-server"
        tags                                    = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (17 unchanged attributes hidden)
    }

  # random_password.temp-backup-vm-password[0] will be destroyed
  # (because random_password.temp-backup-vm-password is not in configuration)
  - resource "random_password" "temp-backup-vm-password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 11 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # sendgrid_api_key.sendgrid-jira-api-key will be updated in-place
  ~ resource "sendgrid_api_key" "sendgrid-jira-api-key" {
        id      = "-pctlKjhSkG_ZLktKoNdxw"
        name    = "jira-email-nonprod-api"
      ~ scopes  = [
          + "mail.batch.create",
          + "mail.batch.delete",
          + "mail.batch.read",
          + "mail.batch.update",
          + "user.scheduled_sends.create",
          + "user.scheduled_sends.delete",
          + "user.scheduled_sends.read",
          + "user.scheduled_sends.update",
            # (8 unchanged elements hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # terraform_data.temp-backup-vm[0] will be destroyed
  # (because terraform_data.temp-backup-vm is not in configuration)
  - resource "terraform_data" "temp-backup-vm" {
      - id               = "b65d4d6f-fe87-0825-ce96-39eb38cfb5d1" -> null
      - triggers_replace = [
          - "7fd65040d1f36ad01916e5be10d55e8e",
        ] -> null
    }

  # terraform_data.vm["atlassian-nonprod-confluence-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "8ad60fb4-fa3d-ee20-a59b-f82bbd7d7c44" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-confluence-04"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "a77eba26-9e02-e082-2184-2a80d5a0dbe2" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-crowd-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "1a33d94c-85a5-a0f7-c9fb-667094f9dedc" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "2ffdbabc-4ab8-c7eb-d424-d5a9e599fa1e" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "759cdc0e-5f10-c36e-4607-a1c7b67683ae" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "45b7efb4-6f5d-7632-e1fe-7a5710f5256c" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "3f66ef0d-9d9f-dc4d-0f44-b055d9b2cec9" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "d136b22e-d22c-7393-8fed-74fafd23ea15" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "8e60a16f-45d6-9071-c88c-2f6f378e4217" -> (known after apply)
      ~ triggers_replace = [
          ~ "c0eba1f3c45c68bcc364a8f88f972cd5" -> "24ae54cf185abba5dbcaeba65e94ef59",
            "15afea25b6d128671e9ba868905c6c9e",
            # (1 unchanged element hidden)
            "4d04a56ef3bff64a2a1fec36659c6c33",
          ~ "fa067dadd13cb910558cd51beaec8e0b" -> "2e9288de26ea9b8aab5ce59c0b54bb7d",
            "e85bc045a37f4b38886472edf1d61bab",
        ]
    }

  # module.temp-vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be destroyed
  # (because azurerm_virtual_machine_extension.custom_script is not in configuration)
  - resource "azurerm_virtual_machine_extension" "custom_script" {
      - auto_upgrade_minor_version  = false -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/temp-backup-vm/extensions/HMCTSVMBootstrap" -> null
      - name                        = "HMCTSVMBootstrap" -> null
      - protected_settings          = (sensitive value) -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.Azure.Extensions" -> null
      - tags                        = {
          - "application"  = "atlassian"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/atlassian-infrastructure"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "staging"
          - "startupMode"  = "always"
        } -> null
      - type                        = "CustomScript" -> null
      - type_handler_version        = "2.1" -> null
      - virtual_machine_id          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/temp-backup-vm" -> null
    }

Plan: 9 to add, 15 to change, 15 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":108,"Program":"tfcmt","SHA1":"","Target":"1022: nonprod_general - TerraformPlanApply","Vars":{}} -->